# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [2]:
import sqlite3
import pandas as pd

In [3]:
conn = sqlite3.Connection('data.sqlite')
cur = conn.cursor()

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [7]:
cur.execute("""select * from orders""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,,121
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,,141

In [11]:
cur.execute("""SELECT customerNumber, contactLastName, contactFirstName
                      FROM customers 
                      WHERE customerNumber in (SELECT customerNumber FROM orders 
                                               WHERE orderDate = '2003-01-31')""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [40]:
cur.execute("""SELECT productName, count(orderNumber) as total_order,
                      sum(quantityOrdered) as quantity_sold
                      FROM products
                      JOIN orderdetails
                      USING (productCode)
                      GROUP BY productName
                      ORDER BY total_order desc;""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

                                   productName  total_order  quantity_sold
0                  1992 Ferrari 360 Spider red           53           1808
1          18th Century Vintage Horse Carriage           28            907
2                       1900s Vintage Bi-Plane           28            940
3                      1900s Vintage Tri-Plane           28           1009
4                  1913 Ford Model T Speedster           28           1038
5                     1917 Maxwell Touring Car           28            992
6                        1926 Ford Fire Engine           28            998
7             1928 British Royal Navy Airplane           28            972
8                     1928 Ford Phaeton Deluxe           28            972
9                       1928 Mercedes-Benz SSK           28            880
10                1930 Buick Marquette Phaeton           28           1074
11                   1932 Model A Ford J-Coupe           28            957
12                          1934 Ford V8 Coupe           28            985
13                       1936 Chrysler Airflow           28            983
14         1936 Harley Davidson El Knucklehead           28            945
15    1936 Mercedes-Benz 500K Special Roadster           28            960
16                   1937 Horch 930V Limousine           28            884
17                        1937 Lincoln Berline           28           1111
18   1938 Cadillac V-16 Presidential Limousine           28            955
19                     1939 Cadillac Limousine           28            995
20                 1939 Chevrolet Deluxe Coupe           28            937
21                    1940 Ford Delivery Sedan           28            923
22                      1940 Ford Pickup Truck           28            999
23                            1940s Ford truck           28           1061
24     1941 Chevrolet Special Deluxe Cabriolet           28           1076
25                    1952 Alpine Renault 1300           28            961
26                 1954 Greyhound Scenicruiser           28            955
27                           1957 Chevy Pickup           28           1056
28         1958 Chevy Corvette Limited Edition           28            983
29                              1958 Setra Bus           28            972
..                                         ...          ...            ...
79                       1976 Ford Gran Torino           27            915
80                     1982 Ducati 900 Monster           27            947
81                           1982 Ducati 996 R           27            906
82                     1982 Lamborghini Diablo           27            912
83           1992 Porsche Cayenne Turbo Silver           27            867
84                             1993 Mazda RX-7           27            947
85                            1995 Honda Civic           27            917
86                           2001 Ferrari Enzo           27           1019
87                          2002 Yamaha YZR M1           27            992
88                    Collectable Wooden Train           27            918
89                                  Pont Yacht           27            958
90                               The Mayflower           27            898
91                              The Queen Mary           27            896
92                       The Schooner Bluenose           27            934
93                                 The Titanic           27            952
94                   The USS Constitution Ship           27           1020
95                          1911 Ford Town Car           25            832
96                    1917 Grand Touring Sedan           25            918
97         1932 Alfa Romeo 8C2300 Spider Sport           25            866
98            1936 Mercedes Benz 500k Roadster           25            824
99              1948 Porsche Type 356 Roadster           25            948
100                         1949 Jaguar XK 120           25            949
101                      1965 Aston Martin DB5           25            914
102                  1966 Shelby Cobra 427 S/C           25            915
103                  1969 Chevrolet Camaro Z28           25            870
104                 1970 Chevy Chevelle SS 454           25            803
105               1999 Indy 500 Monte Carlo SS           25            855
106                        2002 Chevy Corvette           25            894
107                          1952 Citroen-15CV           24            873
108                      1957 Ford Thunderbird           24            767

[109 rows x 3 columns]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [ ]:
cur.execute("""SELECT """)

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
#Your code here

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!